#pragma once
//ゲーム内すべてで共通のヘッダー
//-------------------------------------------------------------------------------------
//ヘッダーの読み込み
//-------------------------------------------------------------------------------------
#include <iostream>
#include <string>
#include <stdio.h>
#include <math.h>
#include "DxLib.h"



//-------------------------------------------------------------------------------------
//定義
//-------------------------------------------------------------------------------------
//int限界
#define IntMax 2147483640

//円周率
#define PI 3.141592654

//画面サイズ
#define WinSizeX 480
#define WinSizeY 270

//フォントサイズ
#define FontSize 9.5
#define FontSizeBig 20

//プレイ人数
enum class PNUM:int
{
	p1, p2, p3, p4, All
};
#define ePNUM (int)PNUM::



