#pragma once
#include "commonDefain.h"

//-------------------------------------------------------------------------------------
//定義
//-------------------------------------------------------------------------------------
struct SPRITE
{
	//全スプライト数
	int numAll;

	//表示するスプライト番号
	int numDisp;

	//画像ID
	list<int> handleId;

	//描画するかどうか
	bool active;

	//UIかどうか
	bool isUI;
	//表示優先度
	byte depth;

	//アルファ値
	byte alpha;

	//倍率
	double extRateX;
	double extRateY;	

	//ポジション
	int postionX;
	int postionY;

	//ローカルポジションタイプ
	bool isLocalPostion;

	//反転
	bool reverseLR;

	//角度
	int angle;
	//回転中心( 0 - 1.0 )
	float anglePivotX;
	float anglePivotY;
};



class drawMng
{
	//-------------------------------------------------------------------------------------
	///private member
	//-------------------------------------------------------------------------------------
	
	//現在メモリ内にある画像(handleId,枚数)
	map<int, int> m_memoryHandleId;

	//ゲーム内で表示する画像(id,list<画像情報>)
	map<int, SPRITE> m_sprites;

	//表示される画像を描画優先度で分けたもの(depth,list<id>)
	map<byte, list<int>> m_depthId;
	map<byte, list<int>> m_depthIdUI;



	//-------------------------------------------------------------------------------------
	///private 関数
	//-------------------------------------------------------------------------------------
public:
	//-------------------------------------------------------------------------------------
	///public member
	//-------------------------------------------------------------------------------------


	//-------------------------------------------------------------------------------------
	///public 関数
	//-------------------------------------------------------------------------------------
	drawMng();
	~drawMng();

	//更新
	void Update();
};

