#include "main.h"

//終了
void End()
{
	// DXライブラリ終了処理
	DxLib_End();
}

//初期化
void Init()
{
	//ウィンドウモードに変更
	ChangeWindowMode(TRUE);
	SetUseXInputFlag(false);

	//ライブラリ初期化
	DxLib_Init();

	//裏画面描画に設定
	SetDrawScreen(DX_SCREEN_BACK);
}

// メインループ
int WINAPI WinMain(HINSTANCE, HINSTANCE, LPSTR, int)
{

	//-------------------------------------------------------------------------------------
	// member
	//-------------------------------------------------------------------------------------
	commonUtil m_commonUtil;

	//-------------------------------------------------------------------------------------
	// 初期化
	//-------------------------------------------------------------------------------------
	Init();


	//-------------------------------------------------------------------------------------
	// メインループ 
	//-------------------------------------------------------------------------------------
	while (ScreenFlip() == 0 && ProcessMessage() == 0 && ClearDrawScreen() == 0)// 裏画面を表画面に反映, メッセージ処理, 画面クリア )
	{
		// 基本更新
		m_commonUtil.CommonUpdate();

		// 文字列の描画
		DrawFormatString(250, 240 - 32, GetColor(255, 255, 255), "カーソルN %d ", m_commonUtil.GetBtnTime(PNUM::p1,BTN::D5));
		DrawFormatString(250, 240 - 12, GetColor(255, 255, 255), "A %d ", m_commonUtil.GetBtnTime(PNUM::p1, BTN::A));
	}


	//-------------------------------------------------------------------------------------
	// 終了
	//-------------------------------------------------------------------------------------
	End();

	return 0;
}


//-------------------------------------------------------------------------------------
//
//-------------------------------------------------------------------------------------